[FunctionHelp]
$casenum9=9@$Casenum@$CASENUM@Kolejny numer bieżącej obserwacji. Zmienna $CASENUM oznacza w każdym przypadku liczbę obserwacji odczytanych dotychczas, łącznie z obserwacją bieżącą. Używany format to F8.0. Wartość zmiennej $CASENUM nie jest zawsze równa numerowi wiersza w oknie Edytora danych (dostępnym w środowiskach obsługujących wyświetlanie w oknach). Wartość zmienia się po posortowaniu pliku lub wstawieniu nowych obserwacji w środku albo na początku pliku.
$sysmis10=10@$Sysmis@$SYSMIS@Systemowy brak danych. Systemowe braki danych są wyświetlane jako kropka (.) lub inny symbol używany jako separator dziesiętny.
$date4=4@$Date@$DATE@Aktualna data podana w formacie międzynarodowym, z rokiem zapisanym za pomocą dwóch cyfr. Używany jest format A9 w postaci dd-mmm-rr.
$jdate4=4@$JDate@$JDATE@Bieżąca data, licząc liczbę dni od 14 października 1582 r. (pierwszego dnia obowiązywania kalendarza gregoriańskiego). Stosowany format to F6.0.
$date114=4@$Date11@$DATE11@Aktualna data podana w formacie międzynarodowym, z rokiem zapisanym za pomocą czterech cyfr. Używany jest format A9 w postaci dd-mmm-rrrr.
$time4=4@$Time@$TIME@Bieżąca data i czas. Zmienna $TIME oznacza liczbę sekund od północy, 14 października 1582 r. do daty i czasu wykonania polecenia przekształcenia. Stosowany format to F20. Tę wartość można wyświetlić na wiele sposobów. Można jej również używać w funkcjach obsługujących datę i czas.
abs1=1@Abs@ABS(?)@ABS(wyrnum). Numeryczny. Zwraca wartość bezwzględną numexpr. Numexpr musi być wyrażeniem liczbowym.
any13=13@Any@ANY(?,?)@ANY(test,wartość[,wartość,...]). Funkcja logiczna. Przyjmuje wartość 1 lub Prawda, jeśli wartość testu odpowiada dowolnej z następujących po nim wartości; w innym przypadku zwraca 0 lub Fałsz. Funkcja ta wymaga dwóch lub więcej argumentów. Na przykład polecenie ANY(var1, 1, 3, 5) zwróci wartość 1, jeśli zmienna var1 ma wartość 1, 3 lub 5, oraz zwróci wartość 0 przy innych wartościach zmiennej. Funkcja ANY może również służyć do skanowania listy zmiennych lub wyrażeń w poszukiwaniu pewnej wartości. Na przykład polecenie ANY(1, var1, var2, var3) zwróci wartość 1, jeśli którakolwiek z trzech podanych zmiennych ma wartość 0, lub zwróci wartość 0, jeśli wszystkie trzy zmienne mają inną wartość niż 1.
applymodel19=19@Applymodel@ApplyModel(?,?,?)@ApplyModel(handle, "function", value). Numeryczny. Stosuje daną funkcję oceniającą do danych wejściowych obserwacji, używając modelu określonego za pomocą obsługi, gdzie „function” jest jedną z następujących literowych wartości tekstowych, ujętych w cudzysłowy: predict, stddev, probability, confidence, nodeid, cumhazard, neighbor, distance. Uchwyt modelu to nazwa związana z zewnętrznym plikiem XML, zgodnie z definicją nadaną w poleceniu MODEL HANDLE. Opcjonalny trzeci argument ma zastosowanie, gdy funkcją jest funkcja "probability", "neighbor" lub "distance". W przypadku funkcji "probability" określana jest kategoria, dla której jest obliczane prawdopodobieństwo. W przypadku funkcji "neighbour" lub "distance" określane jest dane sąsiedztwo (wyrażone jako liczba całkowita) dla najbliższych modeli. Funkcja ApplyModel zwraca systemowy brak danych, jeśli wartość nie może zostać obliczona.
arsin1=1@Arsin@ARSIN(?)@ARSIN(wyrnum). Numeryczny. Zwraca odwrotność sinusa (arcus sinus) wyrażoną w radianach, z wyrażenia numerycznego wyrnum, które przybiera wartości od -1 do +1.
artan1=1@Artan@ARTAN(?)@ARTAN(wyrnum). Numeryczny. Zwraca odwrotność tangensa (arcus tangens) wyrażoną w radianach, z wyrażenia numerycznego wyrnum.
cdf.bernoulli2=2@Cdf.Bernoulli@CDF.BERNOULLI(?,?)@CDF.BERNOULLI(q, p). Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z rozkładu Bernoulliego, z danym parametrem prawdopodobieństwa p, będzie mniejsza lub równa wartości q.
cdf.beta2=2@Cdf.Beta@CDF.BETA(?,?,?)@CDF.BETA(q, kształt1,kształt2). Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z rozkładu Beta, o określonych parametrach kształtu, będzie mniejsza niż q.
cdf.binom2=2@Cdf.Binom@CDF.BINOM(?,?,?)@CDF.BINOM(q, n, p). Numeryczny. Podaje skumulowane prawdopodobieństwo, że liczba sukcesów w n próbach, z prawdopodobieństwem sukcesu p w każdej, będzie mniejsza lub równa q. Dla n równego 1, funkcja ta jest identyczna z CDF.BERNOULLI.
cdf.bvnor2=2@Cdf.Bvnor@CDF.BVNOR(?)@CDF.BVNOR(q1, q2, kor). Numeryczny. Zwraca skumulowane prawdopodobieństwo, że wartość ze standaryzowanego rozkładu normalnego dla dwóch zmiennych o określonym parametrze korelacji będzie mniejsza niż q1 i q2.
cdf.cauchy2=2@Cdf.Cauchy@CDF.CAUCHY(?,?,?)@CDF.CAUCHY(q,poz,skala). Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z rozkładu Cauchy'ego, o określonych parametrach pozycji i skali, będzie mniejsza niż q.
cdf.chisq2=2@Cdf.Chisq@CDF.CHISQ(?,?)@CDF.CHISQ(q,df). Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z rozkładu chi-kwadrat, z df stopniami swobody, będzie mniejsza niż q.
cdf.exp2=2@Cdf.Exp@CDF.EXP(?,?)@CDF.CAUCHY(q,skala). Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z rozkładu wykładniczego, o określonym parametrze skali, będzie mniejsza niż q.
cdf.f2=2@Cdf.F@CDF.F(?,?,?)@CDF.F(q,df1,df2). Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z rozkładu F, ze stopniami swobody df1 i df2, będzie mniejsza niż q.
cdf.gamma2=2@Cdf.Gamma@CDF.GAMMA(?,?,?)@CDF.GAMMA(q,kształt,skala). Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z rozkładu Gamma, o określonych parametrach kształtu i skali, będzie mniejsza niż q.
cdf.geom2=2@Cdf.Geom@CDF.GEOM(?,?)@CDF.BINOM(q, p). Numeryczny. Podaje skumulowane prawdopodobieństwo, że liczba prób potrzebnych do osiągnięcia sukcesu, przy prawdopodobieństwie sukcesu określonym przez p, będzie mniejsza niż q.
cdf.halfnrm2=2@Cdf.Halfnrm@CDF.HALFNRM(?)@CDF.HALFNRM(q,średnia,odchstd). Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z rozkładu półnormalnego, o określonej średniej i odchyleniu standardowym, będzie mniejsza niż q.
cdf.hyper2=2@Cdf.Hyper@CDF.HYPER(?,?,?,?)@CDF.HYPER(q,N,n,ls). Numeryczny. Podaje skumulowane prawdopodobieństwo, że liczba obiektów o określonych cechach będzie mniejsza lub równa q, jeśli n jest liczbą prób losowych z uniwersum o liczebności N i określonej liczbie sukcesów ls.
cdf.igauss2=2@Cdf.Igauss@CDF.IGAUSS(?,?,?)@CDF.IGAUSS(q,poz,skala). Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z odwrotnego rozkładu Gaussa, o określonych parametrach pozycji i skali, będzie mniejsza niż q.
cdf.laplace2=2@Cdf.Laplace@CDF.LAPLACE(?,?,?)@CDF.LAPLACE(q,średnia,skala) numeryczna. Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z rozkładu Laplace'a, o określonych parametrach średniej i skali, będzie mniejsza niż q.
cdf.lnormal2=2@Cdf.Lnormal@CDF.LNORMAL(?,?,?)@CDF.LNORMAL(q,a,b). Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z rozkładu log-normalnego, o określonych parametrach a i b, będzie mniejsza niż q.
cdf.logistic2=2@Cdf.Logistic@CDF.LOGISTIC(?,?,?)@CDF.LOGISTIC(q,średnia,skala). Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z rozkładu logistycznego, o określonych parametrach średniej i skali, będzie mniejsza niż q.
cdf.negbin2=2@Cdf.Negbin@CDF.NEGBIN(?,?,?)@CDF.NEGBIN(q, próg, p). Numeryczny. Podaje skumulowane prawdopodobieństwo, że liczba prób potrzebnych do uzyskania sukcesu, dla danych parametrów wartości progowej i prawdopodobieństwa sukcesu p, będzie mniejsza lub równa q.
cdf.normal2=2@Cdf.Normal@CDF.NORMAL(?,?,?)@CDF.NORMAL(q,średnia,odchstd). Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z rozkładu normalnego, o określonej średniej i odchyleniu standardowym, będzie mniejsza niż q.
cdf.pareto2=2@Cdf.Pareto@CDF.PARETO(?,?,?)@CDF.PARETO(q,próg,kształt). Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z rozkładu Pareto, o określonych parametrach wartości progowej i kształtu, będzie mniejsza niż q.
cdf.poisson2=2@Cdf.Poisson@CDF.POISSON(?,?)@CDF.POISSON(q,średnia). Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z rozkładu Poissona, o określonej średniej, będzie mniejsza lub równa q.
cdf.smod2=2@Cdf.Smod@CDF.SMOD(?)@CDF.SMOD(q,a,b). Numeryczny. Zwraca skumulowane prawdopodobieństwo, że wartość ze studentyzowanego największego modułu o określonych parametrach a i b będzie mniejsza niż q.
cdf.srange2=2@Cdf.Srange@CDF.SRANGE(?)@CDF.SRANGE(q, a, b). Numeryczny. Zwraca skumulowane prawdopodobieństwo, że wartość ze studentyzowanej statystyki rozstępu o określonych parametrach a i b będzie mniejsza niż q.
cdf.t2=2@Cdf.T@CDF.T(?,?)@CDF.T(q, df). Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z rozkładu t Studenta, o określonej liczbie stopni swobody df, będzie mniejsza niż q.
cdf.uniform2=2@Cdf.Uniform@CDF.UNIFORM(?,?,?)@CDF.UNIFORM(q,min,max). Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z rozkładu jednostajnego, o określonych parametrach minimum i maksimum, będzie mniejsza niż q.
cdf.weibull2=2@Cdf.Weibull@CDF.WEIBULL(?,?,?)@CDF.WEIBULL(q,a,b). Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z rozkładu Weibulla, o określonych parametrach a i b, będzie mniejsza niż q.
cdfnorm2=2@Cdfnorm@CDFNORM(?)@CDFNORM(wartośćz). Numeryczny. Podaje prawdopodobieństwo, że zmienna losowa ze średnią 0 i odchyleniem standardowym 1 przyjmie wartość mniejszą niż wyrażenie liczbowe wartość.
cfvar15=15@Cfvar@CFVAR(?,?)@CFVAR(wyrnum,wyrnum[,...]). Numeryczny. Zwraca współczynnik wariancji (odchylenie standardowe podzielone przez średnią) podanych argumentów, jeśli mają ważne wartości. Funkcja ta wymaga dwóch lub więcej argumentów, które muszą być liczbowe. Możliwe jest podanie minimalnej liczby prawidłowych argumentów, niezbędnych do obliczenia wartości tej funkcji.
char.index(2)16=16@Char.Index(2)@CHAR.INDEX(?,?)@CHAR.INDEX(stog, igła[, dzielnik]). Numeryczny. Zwraca liczbę wskazującą na pierwsze położenie podanej igły w wybranym stogu. Opcjonalny trzeci argument dzielnik jest liczbą znaków użytych do podziału ciągu tekstowego określonego parametrem igła na oddzielne ciągi znakowe do odszukania. Wszystkie fragmenty ciągu tekstowego są użyte do wyszukiwania, a funkcja zwraca pierwsze wystąpienie dowolnego fragmentu ciągu tekstowego. Na przykład funkcja CHAR.INDEX(var1, 'abcd') zwróci wartość pozycji początkowej całego ciągu „abcd” w ciągu var1; polecenie CHAR.INDEX(var1, 'abcd', 1) zwróci wartość pierwszego wystąpienia którejkolwiek litery z ciągu „abcd”; a funkcja CHAR.INDEX(var1, 'abcd', 2) zwróci wartość pierwszego wystąpienia ciągu „ab” lub „cd”. Dzielnik musi być dodatnią liczbą całkowitą i musi się dzielić bez reszty przez długość zmiennej igła. Zwraca 0, jeśli igła nie wystąpiła w stogu.
char.index(3)16=16@Char.Index(3)@CHAR.INDEX(?,?,?)@CHAR.INDEX(stog, igła[, dzielnik]). Numeryczny. Zwraca liczbę wskazującą na pierwsze położenie podanej igły w wybranym stogu. Opcjonalny trzeci argument dzielnik jest liczbą znaków użytych do podziału ciągu tekstowego określonego parametrem igła na oddzielne ciągi znakowe do odszukania. Wszystkie fragmenty ciągu tekstowego są użyte do wyszukiwania, a funkcja zwraca pierwsze wystąpienie dowolnego fragmentu ciągu tekstowego. Na przykład funkcja CHAR.INDEX(var1, 'abcd') zwróci wartość pozycji początkowej całego ciągu „abcd” w ciągu var1; polecenie CHAR.INDEX(var1, 'abcd', 1) zwróci wartość pierwszego wystąpienia którejkolwiek litery z ciągu „abcd”; a funkcja CHAR.INDEX(var1, 'abcd', 2) zwróci wartość pierwszego wystąpienia ciągu „ab” lub „cd”. Dzielnik musi być dodatnią liczbą całkowitą i musi się dzielić bez reszty przez długość zmiennej igła. Zwraca 0, jeśli igła nie wystąpiła w stogu.
char.index(2)13=13@Char.Index(2)@CHAR.INDEX(?,?)@CHAR.INDEX(stog, igła[, dzielnik]). Numeryczny. Zwraca liczbę wskazującą na pierwsze położenie podanej igły w wybranym stogu. Opcjonalny trzeci argument dzielnik jest liczbą znaków użytych do podziału ciągu tekstowego określonego parametrem igła na oddzielne ciągi znakowe do odszukania. Wszystkie fragmenty ciągu tekstowego są użyte do wyszukiwania, a funkcja zwraca pierwsze wystąpienie dowolnego fragmentu ciągu tekstowego. Na przykład funkcja CHAR.INDEX(var1, 'abcd') zwróci wartość pozycji początkowej całego ciągu „abcd” w ciągu var1; polecenie CHAR.INDEX(var1, 'abcd', 1) zwróci wartość pierwszego wystąpienia którejkolwiek litery z ciągu „abcd”; a funkcja CHAR.INDEX(var1, 'abcd', 2) zwróci wartość pierwszego wystąpienia ciągu „ab” lub „cd”. Dzielnik musi być dodatnią liczbą całkowitą i musi się dzielić bez reszty przez długość zmiennej igła. Zwraca 0, jeśli igła nie wystąpiła w stogu.
char.index(3)13=13@Char.Index(3)@CHAR.INDEX(?,?,?)@CHAR.INDEX(stog, igła[, dzielnik]). Numeryczny. Zwraca liczbę wskazującą na pierwsze położenie podanej igły w wybranym stogu. Opcjonalny trzeci argument dzielnik jest liczbą znaków użytych do podziału ciągu tekstowego określonego parametrem igła na oddzielne ciągi znakowe do odszukania. Wszystkie fragmenty ciągu tekstowego są użyte do wyszukiwania, a funkcja zwraca pierwsze wystąpienie dowolnego fragmentu ciągu tekstowego. Na przykład funkcja CHAR.INDEX(var1, 'abcd') zwróci wartość pozycji początkowej całego ciągu „abcd” w ciągu var1; polecenie CHAR.INDEX(var1, 'abcd', 1) zwróci wartość pierwszego wystąpienia którejkolwiek litery z ciągu „abcd”; a funkcja CHAR.INDEX(var1, 'abcd', 2) zwróci wartość pierwszego wystąpienia ciągu „ab” lub „cd”. Dzielnik musi być dodatnią liczbą całkowitą i musi się dzielić bez reszty przez długość zmiennej igła. Zwraca 0, jeśli igła nie wystąpiła w stogu.
char.length16=16@Char.Length@CHAR.LENGTH(?)@CHAR.LENGTH(wyrtekst). Numeryczny. Podaje długość wyrażenia tekstowego wyrtekst w znakach. Końcowe spacje zostaną usunięte.
char.lpad(2)16=16@Char.Lpad(2)@CHAR.LPAD(?,?)@CHAR.LPAD(wyrtekst1,długość[,wyrtekst2]). Tekstowy. Wyrażenie wyrtekst1 zostanie przedłużone do wartości określonej przez długość poprzez doklejenie od lewej strony pełnych kopii wyrażenia wyrtekst2. Długość oznacza liczbę znaków i musi być dodatnią liczbą całkowitą. Jeśli opcjonalny argument wyrtekst2 zostanie pominięty, wyrażenie wyrtekst1 zostanie uzupełnione o spacje.
char.lpad(3)16=16@Char.Lpad(3)@CHAR.LPAD(?,?,?)@CHAR.LPAD(wyrtekst1,długość[,wyrtekst2]). Tekstowy. Wyrażenie wyrtekst1 zostanie przedłużone do wartości określonej przez długość poprzez doklejenie od lewej strony pełnych kopii wyrażenia wyrtekst2. Długość oznacza liczbę znaków i musi być dodatnią liczbą całkowitą. Jeśli opcjonalny argument wyrtekst2 zostanie pominięty, wyrażenie wyrtekst1 zostanie uzupełnione o spacje.
char.mblen16=16@Char.Mblen@CHAR.mblen(?,?)@CHAR.MBLEN(wyrtekst,poz). Numeryczny. Zwraca liczbę bajtów znaku o pozycji poz w wyrażeniu wyrtekst.
char.rindex(2)16=16@Char.Rindex(2)@CHAR.RINDEX(?,?)@CHAR.RINDEX(stog,igła[,dzielnik]). Numeryczny. Zwraca liczbę całkowitą, która wskazuje na pozycję początkową ostatniego wystąpienia ciągu tekstowego określonego parametrem igła w ciągu określonym przez stóg. Opcjonalny trzeci argument dzielnik jest liczbą znaków użytych do podziału ciągu tekstowego określonego parametrem igła na oddzielne ciągi znakowe do odszukania. Na przykład funkcja CHAR.RINDEX(var1, 'abcd') zwróci wartość pozycji początkowej ostatniego wystąpienia całego ciągu „abcd” w ciągu var1; polecenie CHAR.RINDEX(var1, 'abcd', 1) zwróci pozycję ostatniego wystąpienia którejkolwiek litery z ciągu „abcd”; a funkcja CHAR.RINDEX(var1, 'abcd', 2) zwróci pozycję ostatniego wystąpienia ciągu „ab” lub „cd”. Dzielnik musi być dodatnią liczbą całkowitą i musi się dzielić bez reszty przez długość zmiennej igła. Zwrócona wartość 0 oznacza, że igła nie została znaleziona.
char.rindex(3)16=16@Char.Rindex(3)@CHAR.RINDEX(?,?,?)@CHAR.RINDEX(stog,igła[,dzielnik]). Numeryczny. Zwraca liczbę całkowitą, która wskazuje na pozycję początkową ostatniego wystąpienia ciągu tekstowego określonego parametrem igła w ciągu określonym przez stóg. Opcjonalny trzeci argument dzielnik jest liczbą znaków użytych do podziału ciągu tekstowego określonego parametrem igła na oddzielne ciągi znakowe do odszukania. Na przykład funkcja CHAR.RINDEX(var1, 'abcd') zwróci wartość pozycji początkowej ostatniego wystąpienia całego ciągu „abcd” w ciągu var1; polecenie CHAR.RINDEX(var1, 'abcd', 1) zwróci pozycję ostatniego wystąpienia którejkolwiek litery z ciągu „abcd”; a funkcja CHAR.RINDEX(var1, 'abcd', 2) zwróci pozycję ostatniego wystąpienia ciągu „ab” lub „cd”. Dzielnik musi być dodatnią liczbą całkowitą i musi się dzielić bez reszty przez długość zmiennej igła. Zwrócona wartość 0 oznacza, że igła nie została znaleziona.
char.rindex(2)13=13@Char.Rindex(2)@CHAR.RINDEX(?,?)@CHAR.RINDEX(stog,igła[,dzielnik]). Numeryczny. Zwraca liczbę całkowitą, która wskazuje na pozycję początkową ostatniego wystąpienia ciągu tekstowego określonego parametrem igła w ciągu określonym przez stóg. Opcjonalny trzeci argument dzielnik jest liczbą znaków użytych do podziału ciągu tekstowego określonego parametrem igła na oddzielne ciągi znakowe do odszukania. Na przykład funkcja CHAR.RINDEX(var1, 'abcd') zwróci wartość pozycji początkowej ostatniego wystąpienia całego ciągu „abcd” w ciągu var1; polecenie CHAR.RINDEX(var1, 'abcd', 1) zwróci pozycję ostatniego wystąpienia którejkolwiek litery z ciągu „abcd”; a funkcja CHAR.RINDEX(var1, 'abcd', 2) zwróci pozycję ostatniego wystąpienia ciągu „ab” lub „cd”. Dzielnik musi być dodatnią liczbą całkowitą i musi się dzielić bez reszty przez długość zmiennej igła. Zwrócona wartość 0 oznacza, że igła nie została znaleziona.
char.rindex(3)13=13@Char.Rindex(3)@CHAR.RINDEX(?,?,?)@CHAR.RINDEX(stog,igła[,dzielnik]). Numeryczny. Zwraca liczbę całkowitą, która wskazuje na pozycję początkową ostatniego wystąpienia ciągu tekstowego określonego parametrem igła w ciągu określonym przez stóg. Opcjonalny trzeci argument dzielnik jest liczbą znaków użytych do podziału ciągu tekstowego określonego parametrem igła na oddzielne ciągi znakowe do odszukania. Na przykład funkcja CHAR.RINDEX(var1, 'abcd') zwróci wartość pozycji początkowej ostatniego wystąpienia całego ciągu „abcd” w ciągu var1; polecenie CHAR.RINDEX(var1, 'abcd', 1) zwróci pozycję ostatniego wystąpienia którejkolwiek litery z ciągu „abcd”; a funkcja CHAR.RINDEX(var1, 'abcd', 2) zwróci pozycję ostatniego wystąpienia ciągu „ab” lub „cd”. Dzielnik musi być dodatnią liczbą całkowitą i musi się dzielić bez reszty przez długość zmiennej igła. Zwrócona wartość 0 oznacza, że igła nie została znaleziona.
char.rpad(2)16=16@Char.Rpad(2)@CHAR.RPAD(?,?)@CHAR.RPAD(wyrtekst1,długość[,wyrtekst2]). Tekstowy. Wyrażenie wyrtekst1 zostanie przedłużone do wartości określonej przez długość poprzez doklejenie od prawej strony pełnych kopii wyrażenia wyrtekst2. Długość oznacza liczbę znaków i musi być dodatnią liczbą całkowitą. Opcjonalny trzeci argument wyrtekst2 jest ciągiem podanym w cudzysłowie lub wyrażeniem tekstowym dającym w wyniku ciąg tekstowy. Jeśli wyrażenie wyrtekst2 zostanie pominięte, wyrażenie wyrtekst1 zostanie uzupełnione o spacje.
char.rpad(3)16=16@Char.Rpad(3)@CHAR.RPAD(?,?,?)@CHAR.RPAD(wyrtekst1,długość[,wyrtekst2]). Tekstowy. Wyrażenie wyrtekst1 zostanie przedłużone do wartości określonej przez długość poprzez doklejenie od prawej strony pełnych kopii wyrażenia wyrtekst2. Długość oznacza liczbę znaków i musi być dodatnią liczbą całkowitą. Opcjonalny trzeci argument wyrtekst2 jest ciągiem podanym w cudzysłowie lub wyrażeniem tekstowym dającym w wyniku ciąg tekstowy. Jeśli wyrażenie wyrtekst2 zostanie pominięte, wyrażenie wyrtekst1 zostanie uzupełnione o spacje.
char.substr(2)16=16@Char.Substr(2)@CHAR.SUBSTR(?,?)@CHAR.SUBSTR(wyrtekst,poz,[długość]). Tekstowy. Zwraca fragment tekstu z wyrażenia wyrtekst rozpoczynający się na podanej pozycji. Trzeci, opcjonalny argument oznacza długość fragmentu ciągu. W razie pominięcia go zostanie zwrócony fragment rozpoczynający się w pozycji poz i kończący w tym samym miejscu co wyrażenie wyrtekst. Na przykład polecenie CHAR.SUBSTR('abcd', 2) zwróci ciąg „bcd”, a polecenie CHAR.SUBSTR('abcd', 2, 2) zwróci ciąg „bc”.
char.substr(3)16=16@Char.Substr(3)@CHAR.SUBSTR(?,?,?)@CHAR.SUBSTR(wyrtekst,poz,[długość]). Tekstowy. Zwraca fragment tekstu z wyrażenia wyrtekst rozpoczynający się na podanej pozycji. Trzeci, opcjonalny argument oznacza długość fragmentu ciągu. W razie pominięcia go zostanie zwrócony fragment rozpoczynający się w pozycji poz i kończący w tym samym miejscu co wyrażenie wyrtekst. Na przykład polecenie CHAR.SUBSTR('abcd', 2) zwróci ciąg „bcd”, a polecenie CHAR.SUBSTR('abcd', 2, 2) zwróci ciąg „bc”.
concat16=16@Concat@CONCAT(?,?)@CONCAT(wyrtekst,wyrtekst[,..]). Tekstowy. Zwraca ciąg znaków, będący połączeniem wszystkich jej argumentów, które same muszą być wyrażeniami tekstowymi. Funkcja ta wymaga dwóch lub więcej argumentów. Jeśli przy trybie strony kodowej, wyrażenie wyrtekst jest zmienną tekstową, to w celu pobrania bieżącej wartości ciągu, bez uzupełniania go z prawej strony do zdefiniowanej szerokości zmiennej, skorzystaj z funkcji RTRIM. Na przykład CONCAT(RTRIM(zmiennatekstowa1), RTRIM(zmiennatekstowa2)).
cos1=1@Cos@COS(?)@COS(rad). Numeryczny. Zwraca cosinus argumentu, który musi być wartością liczbową, wyrażoną w radianach.
ctime.days18=18@Ctime.Days@CTIME.DAYS(?)@CTIME.DAYS(czas). Numeryczny. Zwraca liczbę dni, w tym ułamki dni, zawartych w argumencie czas, który musi być liczbą sekund, wyrażeniem czasowym lub zmienną w formacie czasu.
ctime.hours18=18@Ctime.Hours@CTIME.HOURS(?)@CTIME.HOURS(czas). Numeryczny. Zwraca liczbę godzin, w tym ułamki godzin, zawartych w argumencie czas, który musi być liczbą sekund, wyrażeniem czasowym lub zmienną w formacie czasu.
ctime.minutes18=18@Ctime.Minutes@CTIME.MINUTES(?)@CTIME.MINUTES(czas). Numeryczny. Zwraca liczbę minut, w tym ułamki minut, zawartych w argumencie czas, który musi być liczbą sekund, wyrażeniem czasowym lub zmienną w formacie czasu.
ctime.seconds18=18@Ctime.Seconds@CTIME.SECONDS(?)@CTIME.SECONDS(czas). Numeryczny. Zwraca liczbę sekund, w tym ułamki sekund, zawartych w argumencie czas, który musi być liczbą sekund, wyrażeniem czasowym lub zmienną w formacie czasu.
date.dmy6=6@Date.Dmy@DATE.DMY(?,?,?)@DATE.DMY(dzień,miesiąc,rok). Numeryczny. Podaje wartość daty odpowiadającą wyspecyfikowanym wartościom dzień, miesiąc i rok. Wprowadzone argumenty muszą być liczbami całkowitymi: dzień musi się zawierać w zakresie od 1 do 31, miesiąc od 1 do 13, a rok musi być czterocyfrową liczbą całkowitą większą od 1582. Aby wynik został wyświetlony jako data, należy nadać format daty zmiennej wynikowej.
date.mdy6=6@Date.Mdy@DATE.MDY(?,?,?)@DATE.MDY(miesiąc,dzień,rok). Numeryczny. Podaje wartość daty odpowiadającą wyspecyfikowanym wartościom miesiąc, dzień i rok. Wprowadzone argumenty muszą być liczbami całkowitymi: dzień musi się zawierać w zakresie od 1 do 31, miesiąc od 1 do 13, a rok musi być czterocyfrową liczbą całkowitą większą od 1582. Aby wynik został wyświetlony jako data, należy nadać format daty zmiennej wynikowej.
date.moyr6=6@Date.Moyr@DATE.MOYR(?,?)@DATE.MOYR(miesiąc,rok). Numeryczny. Podaje wartość daty odpowiadającą wyspecyfikowanym wartościom miesiąc i rok. Wprowadzone argumenty muszą być liczbami całkowitymi: miesiąc musi się zawierać w zakresie od 1 do 13, a rok musi być czterocyfrową liczbą całkowitą większą od 1582. Aby wynik został wyświetlony jako data, należy nadać format daty zmiennej wynikowej.
date.qyr6=6@Date.Qyr@DATE.QYR(?,?)@DATE.QYR(kwartał,rok). Numeryczny. Podaje wartość daty odpowiadającą wyspecyfikowanym wartościom kwartał i rok. Wprowadzone argumenty muszą być liczbami całkowitymi: kwartał musi się zawierać w zakresie od 1 do 4, a rok musi być czterocyfrową liczbą całkowitą większą od 1582. Aby wynik został wyświetlony jako data, należy nadać format daty zmiennej wynikowej.
date.wkyr6=6@Date.Wkyr@DATE.WKYR(?,?)@DATE.WKYR(nrtyg,rok). Numeryczny. Podaje wartość daty odpowiadającą wyspecyfikowanym wartościom tydzień i rok. Wprowadzone argumenty muszą być liczbami całkowitymi: gdzie numer tygodnia musi mieć wartość między 1 a 53, a czterocyfrowa liczba całkowita roku musi być większa niż 1582. Zwracana wartość daty przedstawia pierwszy dzień podanego tygodnia dla tego roku. Pierwszy dzień rozpoczyna się 1 stycznia każdego roku tak, że zwracana data dla dowolnej podanej wartości tygodnia będzie się różnić w poszczególnych latach.Aby wyświetlić wyniki w postaci daty, należy przypisać odpowiedni format zmiennej wynikowej.
date.yrday6=6@Date.Yrday@DATE.YRDAY(?,?)@DATE.YRDAY(rok,nrdnia). Numeryczny. Podaje wartość daty odpowiadającą wyspecyfikowanym wartościom rok i nrdnia. Wprowadzone argumenty muszą być liczbami całkowitymi: nrdnia musi się zawierać w zakresie od 1 do 366, a rok musi być czterocyfrową liczbą całkowitą większą od 1582. Aby wynik został wyświetlony jako data, należy nadać format daty zmiennej wynikowej.
datediff5=5@Datediff@DATEDIFF(?,?,?)@DATEDIFF(dataczas1, dataczas2, „jedn"). Numeryczny. Oblicza różnicę między dwoma wartościami data/czas i zwraca liczbę całkowitą (bez ułamków) wyrażoną w określonej jednostce daty/czasu, gdzie dataczas2 i dataczas1 są zmiennymi formatu daty lub czasu (lub wartościami numerycznymi reprezentującymi ważne wartości data/czas), a „jedn" jest jedną z poniższych wartości tekstowych, ujętą w cudzysłów: lata, kwartały, miesiące, tygodnie, dni, godziny, minuty, sekundy.
datesum(3)5=5@Datesum(3)@DATESUM(?,?,?)@DATESUM(dataczas, wartość, „jedn", „metoda"). Numeryczny. Oblicza wartość daty lub czasu odległą o określoną liczbę jednostek od danej daty lub czasu, gdzie dataczas jest zmienną w formacie daty (lub wartością numeryczną reprezentującą ważną wartość data/czas), a „jedn" jest jedną z poniższych wartości tekstowych, ujętą w cudzysłów: lata, kwartały, miesiące, tygodnie, dni, godziny, minuty, sekundy. Opcjonalna metodą ujętą w cudzysłów może być „przerzucanie" lub „najbliższa". Przerzucanie dodaje nadmiarowe dni do kolejnego miesiąca. Najbliższa wykorzystuje najbliższą dozwoloną datę w danym miesiącu. Jest to ustawienie domyślne. Wartość zwracana jest wartością daty/czasu wyrażoną jako liczba sekund. Aby wyświetlić wartość jako datę/czas, przyporządkuj odpowiedni format do zmiennej.
datesum(4)5=5@Datesum(4)@DATESUM(?,?,?,?)@DATESUM(dataczas, wartość, „jedn", „metoda"). Numeryczny. Oblicza wartość daty lub czasu odległą o określoną liczbę jednostek od danej daty lub czasu, gdzie dataczas jest zmienną w formacie daty (lub wartością numeryczną reprezentującą ważną wartość data/czas), a „jedn" jest jedną z poniższych wartości tekstowych, ujętą w cudzysłów: lata, kwartały, miesiące, tygodnie, dni, godziny, minuty, sekundy. Opcjonalna metodą ujętą w cudzysłów może być „przerzucanie" lub „najbliższa". Przerzucanie dodaje nadmiarowe dni do kolejnego miesiąca. Najbliższa wykorzystuje najbliższą dozwoloną datę w danym miesiącu. Jest to ustawienie domyślne. Wartość zwracana jest wartością daty/czasu wyrażoną jako liczba sekund. Aby wyświetlić wartość jako datę/czas, przyporządkuj odpowiedni format do zmiennej.
exp1=1@Exp@EXP(?)@EXP(wyrnum). Numeryczny. Zwraca e podniesione do potęgi wyrnum, gdzie e jest podstawą logarytmu naturalnego a wyrnum jest liczbą. Duże wartości wyrnum mogą dać wyniki przekraczające możliwości obliczeniowe komputera.
idf.beta8=8@Idf.Beta@IDF.BETA(?,?,?)@IDF.BETA(p, kształt, kształt2). Numeryczny. Podaje wartość z rozkładu Beta, o określonych parametrach kształtu, dla której skumulowane prawdopodobieństwo jest równe p.
idf.cauchy8=8@Idf.Cauchy@IDF.CAUCHY(?,?,?)@IDF.CAUCHY(p,poz,skala). Numeryczny. Podaje wartość z rozkładu Cauchy'ego, o określonych parametrach pozycji i skali, dla której skumulowane prawdopodobieństwo jest równe p.
idf.chisq8=8@Idf.Chisq@IDF.CHISQ(?,?)@IDF.CHISQ(p, df). Numeryczny. Podaje wartość z rozkładu chi-kwadrat, o określonej liczbie stopni swobody df, dla której skumulowane prawdopodobieństwo jest równe p. Na przykład, wartość chi-kwadrat, która jest istotna na poziomie 0.05 z 3 stopniami swobody wynosi IDF.CHISQ(0.95,3).
idf.exp8=8@Idf.Exp@IDF.EXP(?,?)@IDF.EXP(p, skala). Numeryczny. Zwraca wartość wykładniczo malejącej zmiennej, ze stopą spadku określoną przez skalę, dla której skumulowane prawdopodobieństwo wynosi p.
idf.f8=8@Idf.F@IDF.F(?,?,?)@IDF.F(p, df1, df2). Numeryczny. Podaje wartość z rozkładu F, o określonej liczbie stopni swobody, dla której skumulowane prawdopodobieństwo wynosi p. Na przykład, wartość F, która jest istotna na poziomie 0.05 z 3 i 100 stopniami swobody wynosi IDF.F(0.95,3,100).
idf.gamma8=8@Idf.Gamma@IDF.GAMMA(?,?,?)@IDF.GAMMA(p,kształt,skala). Numeryczny. Podaje wartość z rozkładu Gamma, o określonych parametrach kształtu i skali, dla której skumulowane prawdopodobieństwo wynosi p.
idf.halfnrm8=8@Idf.Halfnrm@IDF.HALFNRM(?)@IDF.HALFNRM(p, średnia, odchstd). Numeryczny. Podaje wartość z rozkładu normalnego, o określonej średniej i odchyleniu standardowym, dla której skumulowane prawdopodobieństwo wynosi p.
idf.igauss8=8@Idf.Igauss@IDF.IGAUSS(?,?,?)@IDF.IGAUSS(p,poz,skala) numeryczna. Numeryczny. Podaje wartość z odwrotnego rozkładu Gaussa, o określonych parametrach pozycji i skali, dla której skumulowane prawdopodobieństwo jest równe p.
idf.laplace8=8@Idf.Laplace@IDF.LAPLACE(?,?,?)@IDF.LAPLACE(p,średnia,skala) numeryczna. Numeryczny. Podaje wartość z rozkładu Laplace'a, o określonej wartości parametrów średniej i skali, dla której skumulowane prawdopodobieństwo wynosi p.
idf.lnormal8=8@Idf.Lnormal@IDF.LNORMAL(?,?,?)@IDF.LNORMAL(p,a,b). Numeryczny. Podaje wartość z rozkładu logarytmiczno-normalnego, o określonych parametrach a i b, dla której skumulowane prawdopodobieństwo wynosi p.
idf.logistic8=8@Idf.Logistic@IDF.LOGISTIC(?,?,?)@IDF.LOGISTIC(p,średnia,skala). Numeryczny. Zwraca wartość z rozkładu logistycznego o zdefiniowanej średniej i parametrze skali, dla której skumulowane prawdopodobieństwo wynosi p.
idf.normal8=8@Idf.Normal@IDF.NORMAL(?,?,?)@IDF.NORMAL(p,średnia,odchstd). Numeryczny. Podaje wartość z rozkładu normalnego, o określonej średniej i odchyleniu standardowym, dla której skumulowane prawdopodobieństwo wynosi p.
idf.pareto8=8@Idf.Pareto@IDF.PARETO(?,?,?)@IDF.PARETO(p,próg,kształt). Numeryczny. Podaje wartość z rozkładu Pareto, o określonych parametrach wartości progowej i kształtu, dla której skumulowane prawdopodobieństwo wynosi p.
idf.smod8=8@Idf.Smod@IDF.SMOD(?)@IDF.SMOD(p,a,b). Numeryczny. Zwraca wartość ze studentyzowanego największego modułu o określonych parametrach a i b, dla której skumulowane prawdopodobieństwo wynosi p.
idf.srange8=8@Idf.Srange@IDF.SRANGE(?)@IDF.SRANGE(p,a,b). Numeryczny. Zwraca wartość ze studentyzowanej statystyki rozstępu o określonych parametrach a i b, dla której skumulowane prawdopodobieństwo wynosi p.
idf.t8=8@Idf.T@IDF.T(?,?)@IDF.T(p, df). Numeryczny. Podaje wartość z rozkładu t Studenta, o określonej liczbie stopni swobody df, dla której skumulowane prawdopodobieństwo wynosi p.
idf.uniform8=8@Idf.Uniform@IDF.UNIFORM(?,?,?)@IDF.UNIFORM(p, min, max). Numeryczny. Podaje wartość z rozkładu jednostajnego pomiędzy minimum i maksimum, dla której skumulowane prawdopodobieństwo wynosi p.
idf.weibull8=8@Idf.Weibull@IDF.WEIBULL(?,?,?)@IDF.WEIBULL(p, a, b). Numeryczny. Podaje wartość z rozkładu Weibulla, o określonych parametrach, dla której skumulowane prawdopodobieństwo wynosi p.
lag(1)9=9@Lag(1)@LAG(?)@LAG(zmienna[, n]). Funkcja numeryczna lub tekstowa. Wartość zmiennej w poprzedniej obserwacji lub n obserwacji wcześniej. Drugi, opcjonalny argument, n, musi być dodatnią liczbą całkowitą; domyślny wariant to 1. Na przykład funkcja prev4=LAG(gnp,4) zwróci wartość zmiennej gnp dla czwartej obserwacji przed bieżącą. W pierwszych czterech obserwacjach zmienna prev4 ma systemowy brak danych.
lag(2)9=9@Lag(2)@LAG(?,?)@LAG(zmienna[, n]). Funkcja numeryczna lub tekstowa. Wartość zmiennej w poprzedniej obserwacji lub n obserwacji wcześniej. Drugi, opcjonalny argument, n, musi być dodatnią liczbą całkowitą; domyślny wariant to 1. Na przykład funkcja prev4=LAG(gnp,4) zwróci wartość zmiennej gnp dla czwartej obserwacji przed bieżącą. W pierwszych czterech obserwacjach zmienna prev4 ma systemowy brak danych.
length16=16@Length@LENGTH(?)@LENGTH(wyrtekst). Numeryczny. Zwraca w bajtach długość ciągu wyrtekst, który musi być wyrażeniem tekstowym. W przypadku zmiennych tekstowych w trybie Unicode jest to liczba bajtów w każdej wartości, z wyłączeniem końcowych spacji. W trybie strony kodowej jest to zdefiniowana długość zmiennej, łącznie z końcowymi spacjami. W celu uzyskania długości ciągu (w bajtach) należy użyć funkcji LENGTH(RTRIM(wyrtekst)).
lg101=1@Lg10@LG10(?)@LG10(wyrnum). Numeryczny. Zwraca logarytm dziesiętny (o podstawie 10) z wyrnum, które musi być liczbą lub wyrażeniem liczbowym większym od 0.
ln1=1@Ln@LN(?)@LN(wyrnum). Numeryczny. Zwraca logarytm naturalny (o podstawie e) z wyrnum, które musi być liczbą lub wyrażeniem liczbowym większym od 0.
lngamma1=1@Lngamma@LNGAMMA(?)@LNGAMMA(wyrnum). Numeryczny. Zwraca logarytm z kompletnej funkcji Gamma wyrażenia wyrnum, które musi być liczbą lub wyrażeniem liczbowym większym od 0.
lower16=16@Lower@LOWER(?)@LOWER(wyrtekst). Tekstowy. Zwraca ciąg tekstowy wyrtekst zawierający małe litery, które zostają zamienione na duże, zaś inne znaki pozostają niezmienione. Argument może być wartością lub zmienną typu tekstowego. Na przykład jeśli zmienna nazwa1 ma wartość Karol, to funkcja LOWER(nazwa1) zwróci słowo karol.
ltrim(1)16=16@Ltrim(1)@LTRIM(?)@LTRIM(wyrtekst[,znak]). Tekstowy. Funkcja zwraca wyrażenie wyrtekst, z którego początku usunięte zostały wszystkie wystąpienia podanego znaku. Jeśli znak nie został określony, usunięte będą początkowe spacje. Znak musi być pojedynczy.
ltrim(2)16=16@Ltrim(2)@LTRIM(?,?)@LTRIM(wyrtekst[,znak]). Tekstowy. Funkcja zwraca wyrażenie wyrtekst, z którego początku usunięte zostały wszystkie wystąpienia podanego znaku. Jeśli znak nie został określony, usunięte będą początkowe spacje. Znak musi być pojedynczy.
max13=13@Max@MAX(?,?)@MAX(wartość,wartość[,..]). Funkcja numeryczna lub tekstowa. Zwraca maksymalną wartość spośród swoich argumentów, które mają ważne wartości. Funkcja ta wymaga dwóch lub więcej argumentów. Dla wartości numerycznych możliwe jest podanie minimalnej liczby prawidłowych argumentów, niezbędnych do obliczenia wartości tej funkcji.
max15=15@Max@MAX(?,?)@MAX(wartość,wartość[,..]). Funkcja numeryczna lub tekstowa. Zwraca maksymalną wartość spośród swoich argumentów, które mają ważne wartości. Funkcja ta wymaga dwóch lub więcej argumentów. Dla wartości numerycznych możliwe jest podanie minimalnej liczby prawidłowych argumentów, niezbędnych do obliczenia wartości tej funkcji.
mblen.byte16=16@Mblen.Byte@MBLEN.BYTE(?,?)@MBLEN.BYTE(wyrtekst,poz). Numeryczny. Zwraca liczbę bajtów znaku o pozycji w bajcie poz w wyrażeniu wyrtekst.
mean15=15@Mean@MEAN(?,?)@MEAN(wyrnum,wyrnum[,...]) Numeryczny. Zwraca średnią arytmetyczną swoich argumentów mających ważne, niebrakujące wartości. Funkcja ta wymaga dwóch lub więcej argumentów, które muszą być liczbowe. Możliwe jest podanie minimalnej liczby prawidłowych argumentów, niezbędnych do obliczenia wartości tej funkcji.
median15=15@Median@Median(?,?)@MEDIAN(wyrnum,wyrnum[,...]). Numeryczny. Zwraca medianę (50. percentyl) swoich argumentów mających ważne, niebrakujące wartości. Funkcja ta wymaga dwóch lub więcej argumentów, które muszą być liczbowe. Możliwe jest podanie minimalnej liczby prawidłowych argumentów, niezbędnych do obliczenia wartości tej funkcji.
min13=13@Min@MIN(?,?)@MIN(wartość,wartość[,..]). Funkcja numeryczna lub tekstowa. Zwraca minimalną wartość spośród swoich argumentów, które mają ważne, niebrakujące wartości. Funkcja ta wymaga dwóch lub więcej argumentów. Dla wartości numerycznych możliwe jest podanie minimalnej liczby prawidłowych argumentów, niezbędnych do obliczenia wartości tej funkcji.
min15=15@Min@MIN(?,?)@MIN(wartość,wartość[,..]). Funkcja numeryczna lub tekstowa. Zwraca minimalną wartość spośród swoich argumentów, które mają ważne, niebrakujące wartości. Funkcja ta wymaga dwóch lub więcej argumentów. Dla wartości numerycznych możliwe jest podanie minimalnej liczby prawidłowych argumentów, niezbędnych do obliczenia wartości tej funkcji.
missing10=10@Missing@MISSING(?)@MISSING(zmienna). Funkcja logiczna. Przyjmuje wartość 1 lub Prawda, jeśli zmienna zawiera systemowy brak danych lub zdefiniowany brak danych. Argument powinien być nazwą zmiennej w aktywnym zbiorze danych.
mod1=1@Mod@MOD(?,?)@MOD(wyrnum,moduł). Numeryczny. Zwraca resztę z dzielenia wyrnum przez moduł. Oba argumenty muszą być liczbowe, a moduł nie może być równy 0.
ncdf.beta2=2@Ncdf.Beta@NCDF.BETA(?,?,?,?)@NCDF.BETA(q, kształt1, kształt2, nc). Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z niecentralnego rozkładu Beta, o określonych parametrach kształtu i niecentralności nc, będzie mniejsza niż q.
ncdf.chisq2=2@Ncdf.Chisq@NCDF.CHISQ(?,?,?)@NCDF.CHISQ(q, df, nc). Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z niecentralnego rozkładu chi-kwadrat, o określonej liczbie stopni swobody df i parametrze niecentralności nc, będzie mniejsza niż q.
ncdf.f2=2@Ncdf.F@NCDF.F(?,?,?,?)@NCDF.F(q, df1, df2, nc). Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z niecentralnego rozkładu F, o określonej liczbie stopni swobody df1, df2 i parametrze niecentralności nc, będzie mniejsza niż q.
ncdf.t2=2@Ncdf.T@NCDF.T(?,?,?)@NCDF.T(q, df, nc). Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z niecentralnego rozkładu t Studenta, o określonej liczbie stopni swobody df i parametrze niecentralności nc, będzie mniejsza niż q.
nmiss10=10@Nmiss@NMISS(?)@NMISS(zmienna[,..]) Numeryczny. Zwraca liczbę argumentów posiadających systemowe lub zdefiniowane przez użytkownika braki danych. Funkcja ta wymaga jednego lub więcej argumentów, które powinny być nazwami zmiennych z aktywnego zbioru danych.
normalize16=16@Normalize@NORMALIZE(?)@NORMALIZE(wyrtekst). Tekstowy. Zwraca znormalizowaną wersję wyrażenia wyrtekst. W trybie Unicode zwraca wartość w formie Unicode NFC. W trybie strony kodowej funkcja nie ma żadnego efektu i zwraca wyrażenie w formie niezmodyfikowanej. Długość wyniku może odbiegać od długości wprowadzonego wyrażenia.
npdf.beta11=11@Npdf.Beta@NPDF.BETA(?,?,?,?)@NPDF.BETA(q, kształt1, kształt2, nc). Numeryczny. Zwraca gęstość prawdopodobieństwa z niecentralnego rozkładu Beta o określonych parametrach kształtu w punkcie określonym wartością q.
npdf.chisq11=11@Npdf.Chisq@NPDF.CHISQ(?,?,?)@NPDF.CHISQ(q, df, nc). Numeryczny. Zwraca gęstość prawdopodobieństwa z niecentralnego rozkładu chi-kwadrat o df stopni swobody i niecentralności nc w punkcie określonym wartością q.
npdf.f11=11@Npdf.F@NPDF.F(?,?,?,?)@NPDF.F(q, df1, df2, nc). Numeryczny. Podaje gęstość prawdopodobieństwa z niecentralnego rozkładu F, o stopniach swobody df1 i df2 i niecentralność nc w punkcie określonym wartością q.
npdf.t11=11@Npdf.T@NPDF.T(?,?,?)@NPDF.T(q, df, nc). Numeryczny. Zwraca gęstość prawdopodobieństwa z niecentralnego rozkładu t Studenta o określonej liczbie stopni swobody df i niecentralności nc w punkcie określonym wartością q.
ntrim16=16@Ntrim@NTRIM(?)@NTRIM(nazwzmien). Zwraca wartość zmiennej o nazwie nazwzmien, bez usuwania końcowych spacji. Słowo nazwzmien musi określać zmienną; nie może to być wyrażenie.
number3=3@Number@NUMBER(?,?)@NUMBER(wyrtekst,format). Numeryczny. Zwraca wartość wyrażenia tekstowego wyrtekst jako liczbę. Drugi argument, format, jest formatem liczbowym wykorzystanym do odczytania wyrażenia wyrtekst. Przykładowo NUMBER(tekstDATA,DATA11) przekształca ciągi tekstowe zawierające daty w formacie ogólnym dd-mm-rrrr na liczbę sekund reprezentującą daną datę. (Aby wyświetlić wartość w formacie daty, skorzystaj z polecenia FORMATS lub PRINT FORMATS). Jeśli ciąg tekstowy nie może być przeczytany z wykorzystaniem tego formatu, funkcja ta zwraca systemowy brak danych.
nvalid10=10@Nvalid@NVALID(?)@NVALID(zmienna[,..]) Numeryczny. Zwraca liczbę argumentów, które mają ważne wartości (tj. wartości nie będące brakami danych). Funkcja ta wymaga jednego lub więcej argumentów, które powinny być nazwami zmiennych z aktywnego zbioru danych.
pdf.bernoulli11=11@Pdf.Bernoulli@PDF.BERNOULLI(?,?)@PDF.BERNOULLI(q,p). Numeryczny. Zwraca prawdopodobieństwo, że wartość z rozkładu Bernoulliego o danym parametrze prawdopodobieństwa będzie równa q.
pdf.beta11=11@Pdf.Beta@PDF.BETA(?,?,?)@PDF.BETA(q, kształt1,kształt2). Numeryczny. Zwraca gęstość prawdopodobieństwa z rozkładu Beta o określonych parametrach kształtu w punkcie określonym wartością q.
pdf.binom11=11@Pdf.Binom@PDF.BINOM(?,?,?)@PDF.BINOM(q, n, p). Numeryczny. Podaje prawdopodobieństwo, że liczba sukcesów w n próbach, z prawdopodobieństwem sukcesu p w każdej, będzie równa q. Dla n równego 1, funkcja ta jest identyczna z PDF.BERNOULLI.
pdf.bvnor11=11@Pdf.Bvnor@PDF.BVNOR(?,?,?)@PDF.BVNOR(q1, q2, kor). Numeryczny. Zwraca gęstość prawdopodobieństwa ze standaryzowanego rozkładu normalnego dla pary zmiennych o danym parametrze korelacji w punkcie określonym wartościami q1, q2.
pdf.cauchy11=11@Pdf.Cauchy@PDF.CAUCHY(?,?,?)@PDF.CAUCHY(q,poz,skala). Numeryczny. Zwraca gęstość prawdopodobieństwa z rozkładu Cauchy’ego o określonych parametrach pozycji i skali w punkcie określonym wartością q.
pdf.chisq11=11@Pdf.Chisq@PDF.CHISQ(?,?)@PDF.CHISQ(q,df). Numeryczny. Zwraca gęstość prawdopodobieństwa z rozkładu chi-kwadrat o df stopni swobody w punkcie określonym wartością q.
pdf.exp11=11@Pdf.Exp@PDF.EXP(?,?)@PDF.EXP(q,kształt). Numeryczny. Zwraca gęstość prawdopodobieństwa z rozkładu wykładniczego o określonym parametrze kształtu w punkcie określonym wartością q.
pdf.f11=11@Pdf.F@PDF.F(?,?,?)@PDF.F(q,df1,df2). Numeryczny. Podaje gęstość prawdopodobieństwa z rozkładu F, o stopniach swobody df1 i df2, w punkcie określonym wartością q.
pdf.gamma11=11@Pdf.Gamma@PDF.GAMMA(?,?,?)@PDF.GAMMA(q,kształt,skala). Numeryczny. Zwraca gęstość prawdopodobieństwa z rozkładu gamma o określonych parametrach kształtu i skali w punkcie określonym wartością q.
pdf.geom11=11@Pdf.Geom@PDF.GEOM(?,?)@PDF.GEOM(q,p). Numeryczny. Zwraca prawdopodobieństwo, że liczba prób potrzebnych do osiągnięcia sukcesu, przy prawdopodobieństwie sukcesu określonym przez p, będzie równa q.
pdf.halfnrm11=11@Pdf.Halfnrm@PDF.HALFNRM(?,?,?)@PDF.HALFNRM(q,średnia,odchstd). Numeryczny. Zwraca gęstość prawdopodobieństwa z rozkładu półnormalnego o określonej średniej i odchyleniu standardowym w punkcie określonym wartością q.
pdf.hyper11=11@Pdf.Hyper@PDF.HYPER(?,?,?,?)@PDF.HYPER(q,N,n,ls). Numeryczny. Podaje skumulowane prawdopodobieństwo, że liczba obiektów o określonych cechach będzie mniejsza lub równa q, jeśli n jest liczbą prób losowych z uniwersum o liczebności N i określonej liczbie sukcesów ls.
pdf.igauss11=11@Pdf.Igauss@PDF.IGAUSS(?,?,?)@PDF.IGAUSS(q,poz,skala). Numeryczny. Zwraca gęstość prawdopodobieństwa z odwrotnego rozkładu Gaussa o określonych parametrach pozycji i skali w punkcie określonym wartością q.
pdf.laplace11=11@Pdf.Laplace@PDF.LAPLACE(?,?,?)@PDF.LAPLACE(q,średnia,skala). Numeryczny. Zwraca gęstość prawdopodobieństwa z rozkładu Laplace’a o określonych parametrach średniej i skali w punkcie określonym wartością q.
pdf.lnormal11=11@Pdf.Lnormal@PDF.LNORMAL(?,?,?)@PDF.LNORMAL(q,a,b). Numeryczny. Zwraca gęstość prawdopodobieństwa z rozkładu log-normalnego o określonych parametrach kształtu w punkcie określonym wartością q.
pdf.logistic11=11@Pdf.Logistic@PDF.LOGISTIC(?,?,?)@PDF.LOGISTIC(q,średnia,skala). Numeryczny. Zwraca gęstość prawdopodobieństwa z rozkładu logistycznego o określonych parametrach średniej i skali w punkcie określonym wartością q.
pdf.negbin11=11@Pdf.Negbin@PDF.NEGBIN(?,?,?)@PDF.NEGBIN(q,próg,p). Numeryczny. Podaje prawdopodobieństwo, że liczba prób potrzebnych do uzyskania sukcesu, dla danych parametrów wartości progowej i prawdopodobieństwa sukcesu p, będzie równa q.
pdf.normal11=11@Pdf.Normal@PDF.NORMAL(?,?,?)@PDF.NORMAL(q,średnia,odchstd). Numeryczny. Zwraca gęstość prawdopodobieństwa z rozkładu normalnego o określonej średniej i odchyleniu standardowym w punkcie określonym wartością q.
pdf.pareto11=11@Pdf.Pareto@PDF.PARETO(?,?,?)@PDF.PARETO(q,próg,kształt). Numeryczny. Zwraca gęstość prawdopodobieństwa z rozkładu Pareto o określonych parametrach kształtu i progu w punkcie określonym wartością q.
pdf.poisson11=11@Pdf.Poisson@PDF.POISSON(?,?)@PDF.POISSON(q,średnia). Numeryczny. Zwraca prawdopodobieństwo, że wartość z rozkładu Poissona o określonej średniej, będzie równa q.
pdf.t11=11@Pdf.T@PDF.T(?,?)@PDF.T(q,df). Numeryczny. Podaje gęstość prawdopodobieństwa z rozkładu t Studenta o określonej liczbie stopni swobody df w punkcie określonym wartością q.
pdf.uniform11=11@Pdf.Uniform@PDF.UNIFORM(?,?,?)@PDF.UNIFORM(q,min,max). Numeryczny. Zwraca gęstość prawdopodobieństwa z rozkładu jednostajnego o określonej wartości minimum i maksimum w punkcie określonym wartością q.
pdf.weibull11=11@Pdf.Weibull@PDF.WEIBULL(?,?,?)@PDF.WEIBULL(q,a,b). Numeryczny. Zwraca gęstość prawdopodobieństwa z rozkładu Weibulla o określonych parametrach w punkcie określonym wartością q.
range13=13@Range@RANGE(?,?,?)@RANGE(test,min,maks[,min,maks,..]) Funkcja logiczna. Przyjmuje wartość 1 lub Prawda, jeśli wartość testu znajduje się wewnątrz dowolnego z przedziałów, określonych przez pary min i maks. Wszystkie argumenty muszą być liczbowe, albo tekstowe o tej samej długości, jak również wszystkie pary min, maks muszą być uporządkowane tak, że min <= wys. Uwaga: W przypadku wartości tekstowych wyniki mogą być różne w zależności od ustawień regionalnych, nawet dla takiego samego zestawu znaków, ponieważ używany jest narodowy porządek alfabetyczny. Miejsce występowania poszczególnych znaków w szeregu określa kolejność znaków w danym języku, a nie kolejność w tabeli ASCII.
replace(3)13=13@Replace(3)@REPLACE(?,?,?)@REPLACE(a1, a2, a3[, a4]). Tekstowy. W zmiennej a1 wystąpienia wartości a2 są zastępowane wartością a3. Opcjonalny argument a4 określa liczbę wystąpień, które zostaną zastąpione. Jeśli argument a4 zostanie pominięty, zastąpione zostaną wszystkie wystąpienia. Argumenty a1, a2 i a3 muszą zostać rozwiązane do wartości tekstowych (ciągi tekstowe ujęte w cudzysłowy lub zmienne tekstowe). a opcjonalny argument a4 musi zostać rozwiązany do nieujemnej liczby całkowitej. Na przykład polecenie REPLACE(„abcabc”, „a”, „x”) zwróci wartość „xbcxbc”, a polecenie REPLACE(„abcabc”, „a”, „x”, 1) zwróci wartość „xbcabc”.
replace(4)13=13@Replace(4)@REPLACE(?,?,?,?)@REPLACE(a1, a2, a3[, a4]). Tekstowy. W zmiennej a1 wystąpienia wartości a2 są zastępowane wartością a3. Opcjonalny argument a4 określa liczbę wystąpień, które zostaną zastąpione. Jeśli argument a4 zostanie pominięty, zastąpione zostaną wszystkie wystąpienia. Argumenty a1, a2 i a3 muszą zostać rozwiązane do wartości tekstowych (ciągi tekstowe ujęte w cudzysłowy lub zmienne tekstowe). a opcjonalny argument a4 musi zostać rozwiązany do nieujemnej liczby całkowitej. Na przykład polecenie REPLACE(„abcabc”, „a”, „x”) zwróci wartość „xbcxbc”, a polecenie REPLACE(„abcabc”, „a”, „x”, 1) zwróci wartość „xbcabc”.
replace(3)16=16@Replace(3)@REPLACE(?,?,?)@REPLACE(a1, a2, a3[, a4]). Tekstowy. W zmiennej a1 wystąpienia wartości a2 są zastępowane wartością a3. Opcjonalny argument a4 określa liczbę wystąpień, które zostaną zastąpione. Jeśli argument a4 zostanie pominięty, zastąpione zostaną wszystkie wystąpienia. Argumenty a1, a2 i a3 muszą zostać rozwiązane do wartości tekstowych (ciągi tekstowe ujęte w cudzysłowy lub zmienne tekstowe). a opcjonalny argument a4 musi zostać rozwiązany do nieujemnej liczby całkowitej. Na przykład polecenie REPLACE(„abcabc”, „a”, „x”) zwróci wartość „xbcxbc”, a polecenie REPLACE(„abcabc”, „a”, „x”, 1) zwróci wartość „xbcabc”.
replace(4)16=16@Replace(4)@REPLACE(?,?,?,?)@REPLACE(a1, a2, a3[, a4]). Tekstowy. W zmiennej a1 wystąpienia wartości a2 są zastępowane wartością a3. Opcjonalny argument a4 określa liczbę wystąpień, które zostaną zastąpione. Jeśli argument a4 zostanie pominięty, zastąpione zostaną wszystkie wystąpienia. Argumenty a1, a2 i a3 muszą zostać rozwiązane do wartości tekstowych (ciągi tekstowe ujęte w cudzysłowy lub zmienne tekstowe). a opcjonalny argument a4 musi zostać rozwiązany do nieujemnej liczby całkowitej. Na przykład polecenie REPLACE(„abcabc”, „a”, „x”) zwróci wartość „xbcxbc”, a polecenie REPLACE(„abcabc”, „a”, „x”, 1) zwróci wartość „xbcabc”.
rnd(1)1=1@Rnd(1)@RND(?)@RND(wyrnum[,wlk,bity]). Numeryczny. Przy jednym argumencie zwracana jest najbliższa mu liczba całkowita. Liczby zakończone na ,5 są zaokrąglane tak, aby były dalej od 0. Na przykład polecenie RND(-4.5) spowoduje zaokrąglenie argumentu do -5. Drugi, opcjonalny argument, wlk, określa liczbę, której wielokrotnością ma być wynik. Na przykład funkcja RND(-4.57,0.1) zwróci wynik -4,6. Wartość ma być liczbą, ale musi być różna od 0. Domyślna wartość to 1. Trzeci, opcjonalny argument, bity, to liczba najmniej znaczących bitów, których może brakować w wyrażeniu wyrnum przy zaokrąglaniu w górę (np. 0,5 przy zaokrąglaniu do liczby całkowitej), ale które mimo to pozwolą na zaokrąglenie wyrażenia w górę. W przypadku jego pominięcia używane jest ustawienie systemowe najmniej ważnych bitów (w czasie instalacji ustawione na wartość 6).
rnd(2)1=1@Rnd(2)@RND(?,?)@RND(wyrnum[,wlk,bity]). Numeryczny. Przy jednym argumencie zwracana jest najbliższa mu liczba całkowita. Liczby zakończone na ,5 są zaokrąglane tak, aby były dalej od 0. Na przykład polecenie RND(-4.5) spowoduje zaokrąglenie argumentu do -5. Drugi, opcjonalny argument, wlk, określa liczbę, której wielokrotnością ma być wynik. Na przykład funkcja RND(-4.57,0.1) zwróci wynik -4,6. Wartość ma być liczbą, ale musi być różna od 0. Domyślna wartość to 1. Trzeci, opcjonalny argument, bity, to liczba najmniej znaczących bitów, których może brakować w wyrażeniu wyrnum przy zaokrąglaniu w górę (np. 0,5 przy zaokrąglaniu do liczby całkowitej), ale które mimo to pozwolą na zaokrąglenie wyrażenia w górę. W przypadku jego pominięcia używane jest ustawienie systemowe najmniej ważnych bitów (w czasie instalacji ustawione na wartość 6).
rnd(3)1=1@Rnd(3)@RND(?,?,?)@RND(wyrnum[,wlk,bity]). Numeryczny. Przy jednym argumencie zwracana jest najbliższa mu liczba całkowita. Liczby zakończone na ,5 są zaokrąglane tak, aby były dalej od 0. Na przykład polecenie RND(-4.5) spowoduje zaokrąglenie argumentu do -5. Drugi, opcjonalny argument, wlk, określa liczbę, której wielokrotnością ma być wynik. Na przykład funkcja RND(-4.57,0.1) zwróci wynik -4,6. Wartość ma być liczbą, ale musi być różna od 0. Domyślna wartość to 1. Trzeci, opcjonalny argument, bity, to liczba najmniej znaczących bitów, których może brakować w wyrażeniu wyrnum przy zaokrąglaniu w górę (np. 0,5 przy zaokrąglaniu do liczby całkowitej), ale które mimo to pozwolą na zaokrąglenie wyrażenia w górę. W przypadku jego pominięcia używane jest ustawienie systemowe najmniej ważnych bitów (w czasie instalacji ustawione na wartość 6).
rtrim(1)16=16@Rtrim(1)@RTRIM(?)@RTRIM(wyrtekst[,znak]). Tekstowy. Usunięcie końcowych wystąpień znaku w wyrażeniu wyrtekst. Opcjonalny drugi argument jest jednym znakiem w apostrofie lub wyrażeniem tekstowym, dającym w wyniku jeden znak. Jeśli argument znak zostanie pominięty, usunięte zostaną końcowe spacje.
rtrim(2)16=16@Rtrim(2)@RTRIM(?,?)@RTRIM(wyrtekst[,znak]). Tekstowy. Usunięcie końcowych wystąpień znaku w wyrażeniu wyrtekst. Opcjonalny drugi argument jest jednym znakiem w apostrofie lub wyrażeniem tekstowym, dającym w wyniku jeden znak. Jeśli argument znak zostanie pominięty, usunięte zostaną końcowe spacje.
rv.bernoulli12=12@Rv.Bernoulli@RV.BERNOULLI(?)@RV.BERNOULLI(p). Numeryczny. Generuje liczby losowe o rozkładzie Bernoulliego z określoną wartością parametru prawdopodobieństwa p.
rv.beta12=12@Rv.Beta@RV.BETA(?,?)@RV.BETA(kształt1,kształt2). Numeryczny. Generuje liczby losowe o rozkładzie Beta z określoną wartością parametrów kształtu.
rv.binom12=12@Rv.Binom@RV.BINOM(?,?)@RV.BINOM(n,p). Numeryczny. Generuje liczby losowe o rozkładzie dwumianowym z określoną wartością parametrów: n (liczba prób) i p (prawdopodobieństwo odniesienia sukcesu).
rv.cauchy12=12@Rv.Cauchy@RV.CAUCHY(?,?)@RV.CAUCHY(poz,skala). Numeryczny. Generuje liczby losowe o rozkładzie Cauchy'ego z określoną wartością parametrów: poz (położenie) i skala.
rv.chisq12=12@Rv.Chisq@RV.CHISQ(?)@RV.CHISQ(df). Numeryczny. Generuje liczby losowe o rozkładzie chi-kwadrat z określoną liczbą stopni swobody df.
rv.exp12=12@Rv.Exp@RV.EXP(?)@RV.EXP(skala). Numeryczny. Generuje liczby losowe o rozkładzie wykładniczym z określoną wartością parametru skali.
rv.f12=12@Rv.F@RV.F(?,?)@RV.F(df1,df2). Numeryczny. Generuje liczby losowe o rozkładzie F z określonymi stopniami swobody df1 i df2.
rv.gamma12=12@Rv.Gamma@RV.GAMMA(?,?)@RV.GAMMA(kształt,skala). Numeryczny. Generuje liczby losowe o rozkładzie Gamma z określoną wartością parametrów kształtu i skali.
rv.geom12=12@Rv.Geom@RV.GEOM(?)@RV.GEOM(p). Numeryczny. Generuje liczby losowe o rozkładzie geometrycznym z określoną wartością parametru prawdopodobieństwa p.
rv.halfnrm12=12@Rv.Halfnrm@RV.HALFNRM(?)@RV.HALFNRM(średnia,odchstd). Numeryczny. Generuje liczby losowe o rozkładzie półnormalnym z określoną wartością parametrów: średnia oraz odchstd (odchylenie standardowe).
rv.hyper12=12@Rv.Hyper@RV.HYPER(?,?,?)@RV.HYPER(N,n,ls). Numeryczny. Zwraca wartość losową z rozkładu hipergeometrycznego o określonej wartości parametrów.
rv.igauss12=12@Rv.Igauss@RV.IGAUSS(?,?)@RV.IGAUSS(poz,skala). Numeryczny. Zwraca wartość losową z rozkładu Gaussa o określonej wartości parametrów: poz (położenie) i skala.
rv.laplace12=12@Rv.Laplace@RV.LAPLACE(?,?)@RV.LAPLACE(średnia,skala). Numeryczny. Generuje liczby losowe o rozkładzie Laplace'a z określoną wartością parametrów średniej i skali.
rv.lnormal12=12@Rv.Lnormal@RV.LNORMAL(?,?)@RV.LNORMAL(a,b). Numeryczny. Zwraca wartość losową z rozkładu logarytmiczno-normalnego o określonej wartości parametrów.
rv.logistic12=12@Rv.Logistic@RV.LOGISTIC(?,?)@RV.LOGISTIC(średnia,skala). Numeryczny. Generuje liczby losowe o rozkładzie logistycznym z określoną wartością parametrów średniej i skali.
rv.negbin12=12@Rv.Negbin@RV.NEGBIN(?,?)@RV.NEGBIN(próg,p). Numeryczny. Generuje liczby losowe o ujemnym rozkładzie dwumianowym (rozkładzie Pascala) z określoną wartością parametrów: próg (wartość progowa) i p (prawdopodobieństwo sukcesu).
rv.normal12=12@Rv.Normal@RV.NORMAL(?,?)@RV.NORMAL(średnia, odchstd). Numeryczny. Generuje liczby losowe o rozkładzie normalnym z określoną wartością parametrów: średnia oraz odchstd (odchylenie standardowe).
rv.pareto12=12@Rv.Pareto@RV.PARETO(?,?)@RV.PARETO(próg,kształt). Numeryczny. Generuje liczby losowe o rozkładzie Pareto z określoną wartością parametrów: próg (wartość progowa) oraz kształt.
rv.poisson12=12@Rv.Poisson@RV.POISSON(?)@RV.POISSON(średnia). Numeryczny. Generuje liczby losowe o rozkładzie Poissona z określoną wartością parametru średnia/iloraz.
rv.t12=12@Rv.T@RV.T(?)@RV.T(df). Numeryczny. Generuje liczby losowe o rozkładzie t Studenta z określoną liczbą stopni swobody df.
rv.uniform12=12@Rv.Uniform@RV.UNIFORM(?,?)@RV.UNIFORM(min,maks). Numeryczny. Generuje liczby losowe o rozkładzie jednostajnym dla określonej wartości minimalnej (min) i maksymalnej (maks). Zobacz także funkcję UNIFORM.
rv.weibull12=12@Rv.Weibull@RV.WEIBULL(?,?)@RV.WEIBULL(a,b). Numeryczny. Zwraca wartość losową z rozkładu Weibulla o określonej wartości parametrów.
sd15=15@Sd@SD(?,?)@SD(wyrnum,wyrnum[,...]) Numeryczny. Oblicza wartość odchylenia standardowego dla liczb będących jej argumentami, o ile mają prawidłowe, niebrakujące wartości. Funkcja ta wymaga dwóch lub więcej argumentów, które muszą być liczbowe. Możliwe jest podanie minimalnej liczby prawidłowych argumentów, niezbędnych do obliczenia wartości tej funkcji.
sig.chisq14=14@Sig.Chisq@SIG.CHISQ(?)@SIG.CHISQ(q,df). Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z rozkładu chi-kwadrat, z df stopniami swobody, będzie większa niż q
sig.f14=14@Sig.F@SIG.F(?)@SIG.F(q,df1,df2). Numeryczny. Podaje skumulowane prawdopodobieństwo, że wartość z rozkładu F, ze stopniami swobody df1 i df2, będzie większe niż q.
sin1=1@Sin@SIN(?)@SIN(rad). Numeryczny. Zwraca sinus argumentu, który musi być wartością liczbową, wyrażoną w radianach.
sqrt1=1@Sqrt@SQRT(?)@SQRT(wyrnum). Numeryczny. Oblicza wartość pierwiastka kwadratowego z wyrażenia wyrnum, które musi być wyrażeniem numerycznym o wartościach nieujemnych.
strapplymodel19=19@Strapplymodel@StrApplyModel(?,?,?)@StrApplyModel(handle, "function", value). Tekstowy. Stosuje daną funkcję oceniającą do danych wejściowych obserwacji, używając modelu określonego za pomocą obsługi, gdzie „function” jest jedną z następujących literowych wartości tekstowych, ujętych w cudzysłowy: predict, stddev, probability, confidence, nodeid, cumhazard, neighbor, distance. Uchwyt modelu to nazwa związana z zewnętrznym plikiem XML, zgodnie z definicją nadaną w poleceniu MODEL HANDLE. Opcjonalny trzeci argument ma zastosowanie, gdy funkcją jest funkcja "probability", "neighbor" lub "distance". W przypadku funkcji "probability" określana jest kategoria, dla której jest obliczane prawdopodobieństwo. W przypadku funkcji "neighbour" lub "distance" określane jest dane sąsiedztwo (wyrażone jako liczba całkowita) dla najbliższych modeli. Funkcja StrApplyModel zwraca pusty ciąg, jeśli wartość nie może zostać obliczona.
string3=3@String@STRING(?,?)@STRING(wyrnum,format). Tekstowy. Zamienia wartość wyrażenia numerycznego wyrnum na tekst, zgodnie z określonym formatem. Funkcja STRING(-1.5,F5.2) zwraca wartość tekstową „-1.50”. Drugi argument, format, musi określać format zapisu wartości wyrażenia numerycznego.
strunc16=16@Strunc@STRUNC(?,?)@STRUNC(wyrtekst, długość). Tekstowy. Polecenie zwraca wyrażenie wyrtekst skrócone do podanej długości i z usuniętymi końcowymi spacjami. Podczas skracania usuwane są fragmenty kasowanego znaku.
sum15=15@Sum@SUM(?,?)@SUM(wyrnum,wyrnum[,...]) Numeryczny. Oblicza sumę wyrażeń numerycznych (wyrnum) będących jej argumentami i mających poprawne, niebrakujące wartości. Funkcja ta wymaga dwóch lub więcej argumentów, które muszą być liczbowe. Możliwe jest podanie minimalnej liczby prawidłowych argumentów, niezbędnych do obliczenia wartości tej funkcji.
sysmis10=10@Sysmis@SYSMIS(?)@SYSMIS(zmnum). Funkcja logiczna. Przyjmuje wartość 1 lub Prawda, jeśli argument zmnum oznacza systemowy brak wartości. Argument zmnum musi być nazwą zmiennej numerycznej z aktualnie otwartego pliku danych.
time.days17=17@Time.Days@TIME.DAYS(?)@TIME.DAYS(dni). Numeryczny. Oblicza przedział czasu odpowiadający podanej liczbie dni. Argument ten musi być liczbowy. Aby wyświetlić wyniki w postaci czasu, należy przypisać odpowiedni format zmiennej wynikowej.
time.hms(1)17=17@Time.Hms(1)@TIME.HMS(?)@TIME.HMS(godz[,min,sek]). Numeryczny. Oblicza przedział czasu odpowiadający podanej liczbie godzin, minut i sekund. Argumenty z minutami i sekundami są opcjonalne. Jeśli godziny i minuty są niezerowe, to minuty i sekundy muszą być liczbami mniejszymi od 60. Wszystkie argumenty poza ostatnim, który jest różny od zera, muszą być liczbami całkowitymi. Na przykład polecenia TIME.HMS(25.5) i TIME.HMS(0,90,25.5) są prawidłowe, a polecenia TIME.HMS(25.5,30) i TIME.HMS(25,90) są nieprawidłowe. Wszystkie argumenty muszą być jednocześnie albo dodatnie, albo ujemne. Aby wyświetlić wyniki w postaci czasu, należy przypisać odpowiedni format zmiennej wynikowej.
time.hms(2)17=17@Time.Hms(2)@TIME.HMS(?,?)@TIME.HMS(godz[,min,sek]). Numeryczny. Oblicza przedział czasu odpowiadający podanej liczbie godzin, minut i sekund. Argumenty z minutami i sekundami są opcjonalne. Jeśli godziny i minuty są niezerowe, to minuty i sekundy muszą być liczbami mniejszymi od 60. Wszystkie argumenty poza ostatnim, który jest różny od zera, muszą być liczbami całkowitymi. Na przykład polecenia TIME.HMS(25.5) i TIME.HMS(0,90,25.5) są prawidłowe, a polecenia TIME.HMS(25.5,30) i TIME.HMS(25,90) są nieprawidłowe. Wszystkie argumenty muszą być jednocześnie albo dodatnie, albo ujemne. Aby wyświetlić wyniki w postaci czasu, należy przypisać odpowiedni format zmiennej wynikowej.
time.hms(3)17=17@Time.Hms(3)@TIME.HMS(?,?,?)@TIME.HMS(godz[,min,sek]). Numeryczny. Oblicza przedział czasu odpowiadający podanej liczbie godzin, minut i sekund. Argumenty z minutami i sekundami są opcjonalne. Jeśli godziny i minuty są niezerowe, to minuty i sekundy muszą być liczbami mniejszymi od 60. Wszystkie argumenty poza ostatnim, który jest różny od zera, muszą być liczbami całkowitymi. Na przykład polecenia TIME.HMS(25.5) i TIME.HMS(0,90,25.5) są prawidłowe, a polecenia TIME.HMS(25.5,30) i TIME.HMS(25,90) są nieprawidłowe. Wszystkie argumenty muszą być jednocześnie albo dodatnie, albo ujemne. Aby wyświetlić wyniki w postaci czasu, należy przypisać odpowiedni format zmiennej wynikowej.
trunc(1)1=1@Trunc(1)@TRUNC(?)@TRUNC(wyrnum[,wlk,bity]). Numeryczny. Zwraca wartość wyrażenia wyrnum skróconego w stronę 0. Drugi, opcjonalny argument, wlk, określa liczbę, której wielokrotnością ma być wynik—Na przykład funkcja TRUNC(4.579,0.1) zwróci wynik 4,5. Wartość ma być liczbą, ale musi być różna od 0. Domyślna wartość to 1. Trzeci opcjonalny argument, bity, to liczba najmniej znaczących bitów, których może brakować w wyrażeniu wyrnum w porównaniu z najbliższą wartością docelową, do zaokrąglenia w górę. Na przykład jeśli wartość wyrażenia wyrnum znajduje się w przedziale od 1,4 do 1,5, a wartość wlk wynosi 0,1, wartość bity oznacza, jak blisko wyrażenie wyrnum może znajdować się od 1,5 (najbliższej wartości docelowej) i zostać zaokrąglone w górę. W przypadku jego pominięcia używane jest ustawienie systemowe najmniej ważnych bitów (w czasie instalacji ustawione na wartość 6).
trunc(2)1=1@Trunc(2)@TRUNC(?,?)@TRUNC(wyrnum[,wlk,bity]). Numeryczny. Zwraca wartość wyrażenia wyrnum skróconego w stronę 0. Drugi, opcjonalny argument, wlk, określa liczbę, której wielokrotnością ma być wynik—Na przykład funkcja TRUNC(4.579,0.1) zwróci wynik 4,5. Wartość ma być liczbą, ale musi być różna od 0. Domyślna wartość to 1. Trzeci opcjonalny argument, bity, to liczba najmniej znaczących bitów, których może brakować w wyrażeniu wyrnum w porównaniu z najbliższą wartością docelową, do zaokrąglenia w górę. Na przykład jeśli wartość wyrażenia wyrnum znajduje się w przedziale od 1,4 do 1,5, a wartość wlk wynosi 0,1, wartość bity oznacza, jak blisko wyrażenie wyrnum może znajdować się od 1,5 (najbliższej wartości docelowej) i zostać zaokrąglone w górę. W przypadku jego pominięcia używane jest ustawienie systemowe najmniej ważnych bitów (w czasie instalacji ustawione na wartość 6).
trunc(3)1=1@Trunc(3)@TRUNC(?,?,?)@TRUNC(wyrnum[,wlk,bity]). Numeryczny. Zwraca wartość wyrażenia wyrnum skróconego w stronę 0. Drugi, opcjonalny argument, wlk, określa liczbę, której wielokrotnością ma być wynik—Na przykład funkcja TRUNC(4.579,0.1) zwróci wynik 4,5. Wartość ma być liczbą, ale musi być różna od 0. Domyślna wartość to 1. Trzeci opcjonalny argument, bity, to liczba najmniej znaczących bitów, których może brakować w wyrażeniu wyrnum w porównaniu z najbliższą wartością docelową, do zaokrąglenia w górę. Na przykład jeśli wartość wyrażenia wyrnum znajduje się w przedziale od 1,4 do 1,5, a wartość wlk wynosi 0,1, wartość bity oznacza, jak blisko wyrażenie wyrnum może znajdować się od 1,5 (najbliższej wartości docelowej) i zostać zaokrąglone w górę. W przypadku jego pominięcia używane jest ustawienie systemowe najmniej ważnych bitów (w czasie instalacji ustawione na wartość 6).
upcase16=16@Upcase@UPCASE(?)@UPCASE(wyrtekst). Tekstowy. Zwraca ciąg tekstowy wyrtekst zawierający małe litery, które zostają zamienione na duże, zaś inne znaki pozostają niezmienione.
value10=10@Value@VALUE(?)@VALUE(zmienna). Funkcja numeryczna lub tekstowa. Podaje wartość zmiennej, ignorując jej zdefiniowane braki wartości zmiennej, która musi być nazwą lub wektorem odniesienia do nazwy zmiennej.
valuelabel9=9@Valuelabel@VALUELABEL(?)@VALUELABEL(nazwzmien). Tekstowy. Podaje etykietę wartości dla danej wartości zmiennej lub pusty ciąg, jeśli nie istnieje etykieta dla danej wartości. Słowo nazwzmien musi określać zmienną; nie może to być wyrażenie.
variance15=15@Variance@VARIANCE(?,?)@VARIANCE(wyrnum,wyrnum[,...]). Numeryczny. Oblicza wartość wariancji liczb będących jej argumentami, o ile mają dopuszczalne wartości. Funkcja ta wymaga dwóch lub więcej argumentów, które muszą być liczbowe. Możliwe jest podanie minimalnej liczby prawidłowych argumentów, niezbędnych do obliczenia wartości tej funkcji.
xdate.date7=7@Xdate.Date@XDATE.DATE(?)@XDATE.DATE(data). Numeryczny. Zwrócenie daty z wartości numerycznej, która zawiera datę. Argumentem może być liczba, zmienna w formacie daty lub wyrażenie, które opisuje datę. Aby wyświetlić wyniki w postaci daty, należy przypisać odpowiedni format zmiennej wynikowej.
xdate.hour18=18@Xdate.Hour@XDATE.HOUR(?)@XDATE.HOUR(dataczas). Numeryczny. Z wartości zawierającej czas lub datę i czas zwraca godzinę (liczbę całkowitą między od 0 do 23). Argumentem może być liczba, zmienna czasu lub daty i czasu albo wyrażenie, które opisuje czas lub datę i czas.
xdate.jday7=7@Xdate.Jday@XDATE.JDAY(?)@XDATE.JDAY(data). Numeryczny. Podaje dzień roku (liczba całkowita pomiędzy 1 a 366) z wartości liczbowej określającej datę. Argumentem może być liczba, zmienna w formacie daty lub wyrażenie, które opisuje datę.
xdate.mday7=7@Xdate.Mday@XDATE.MDAY(?)@XDATE.MDAY(data). Numeryczny. Podaje dzień miesiąca (liczba całkowita pomiędzy 1 a 31) z wartości liczbowej określającej datę. Argumentem może być liczba, zmienna w formacie daty lub wyrażenie, które opisuje datę.
xdate.minute18=18@Xdate.Minute@XDATE.MINUTE(?)@XDATE.MINUTE(dataczas). Numeryczny. Z wartości zawierającej czas lub datę i czas zwraca minutę (liczbę całkowitą między od 0 do 59). Argumentem może być liczba, zmienna czasu lub daty i czasu albo wyrażenie, które opisuje czas lub datę i czas.
xdate.month7=7@Xdate.Month@XDATE.MONTH(?)@XDATE.MONTH(data). Numeryczny. Podaje miesiąc (liczba całkowita pomiędzy 1 a 12) z wartości liczbowej określającej datę. Argumentem może być liczba, zmienna w formacie daty lub wyrażenie, które opisuje datę.
xdate.quarter7=7@Xdate.Quarter@XDATE.QUARTER(?)@XDATE.QUARTER(data). Numeryczny. Podaje kwartał roku (liczba całkowita pomiędzy 1 a 4) z wartości liczbowej określającej datę. Argumentem może być liczba, zmienna w formacie daty lub wyrażenie, które opisuje datę.
xdate.second18=18@Xdate.Second@XDATE.SECOND(?)@XDATE.SECOND(dataczas). Numeryczny. Z wartości zawierającej czas lub datę i czas zwraca sekundę (liczbę całkowitą między od 0 do 60). Argumentem może być liczba, zmienna czasu lub daty i czasu albo wyrażenie, które opisuje czas lub datę i czas.
xdate.tday7=7@Xdate.Tday@XDATE.TDAY(?)@XDATE.TDAY(czas). Numeryczny. Z wartości liczbowej opisującej przedział czasu zwraca (w postaci liczby całkowitej) liczbę pełnych dni. Argumentem może być liczba, zmienna w formacie czasu lub wyrażenie, które opisuje czas.
xdate.tday18=18@Xdate.Tday@XDATE.TDAY(?)@XDATE.TDAY(czas). Numeryczny. Z wartości liczbowej opisującej przedział czasu zwraca (w postaci liczby całkowitej) liczbę pełnych dni. Argumentem może być liczba, zmienna w formacie czasu lub wyrażenie, które opisuje czas.
xdate.time7=7@Xdate.Time@XDATE.TIME(?)@XDATE.TIME(dataczas). Numeryczny. Z wartości określającej czas lub datę i czas zwraca informacje o czasie. Argumentem może być liczba, zmienna czasu lub daty i czasu albo wyrażenie, które opisuje czas lub datę i czas. Aby wyświetlić wyniki w postaci czasu, należy przypisać odpowiedni format zmiennej wynikowej.
xdate.week7=7@Xdate.Week@XDATE.WEEK(?)@XDATE.WEEK(data). Numeryczny. Z wartości określającej określającej datę zwraca numer tygodnia (liczbę całkowitą pomiędzy 1 a 53). Argumentem może być liczba, zmienna w formacie daty lub wyrażenie, które opisuje datę.
xdate.wkday7=7@Xdate.Wkday@XDATE.WKDAY(?)@XDATE.WKDAY(data). Numeryczny. Z wartości określającej datę zwraca numer dnia tygodnie (liczbę całkowitą z zakresu od 1, czyli niedzieli, do 7, czyli soboty). Argumentem może być liczba, zmienna w formacie daty lub wyrażenie, które opisuje datę.
xdate.year7=7@Xdate.Year@XDATE.YEAR(?)@XDATE.YEAR(data). Numeryczny. Z wartości numerycznej opisującej datę zwraca rok (w postaci czterocyfrowej liczby całkowitej). Argumentem może być liczba, zmienna w formacie daty lub wyrażenie, które opisuje datę.
yrmoda7=7@Yrmoda@YRMODA(?,?,?)@YRMODA(rok,miesiąc,dzień). Numeryczny. Podaje liczbę dni, jakie upłynęły od 15 października 1582 roku do daty podanej jako argumenty funkcji, które muszą być poprawnymi liczbami całkowitymi (data powinna być późniejsza niż 15.10.1582). Do dwucyfrowego oznaczenia roku zostanie dodany przedrostek oznaczający stulecie, zgodnie z ustawieniami dokonanymi w oknie dialogowym Opcje (menu Edytuj, Opcje, zakładka Dane). Domyślnie dwucyfrowa reprezentacja lat zakłada stuletni okres, rozpoczynający się 69 lat przed bieżącym rokiem i kończący się 30 lat po nim.
